app/controllers/alunos_controller.rb

SELECT "alunos".* FROM "alunos"
---
  def index
    @alunos = Aluno.all

INSERT INTO "alunos" ("p_nome", "p_endereco", "p_bairro", "p_numero", "p_cidade", "p_complemento", "p_cep", "p_email", "p_nome_inst", "p_login", "p_senha", "p_data_nasc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @aluno = Aluno.new(aluno_params)

    respond_to do |format|
      if @aluno.save

UPDATE "alunos" SET "p_nome" = ?, "updated_at" = ? WHERE "alunos"."id" = ?  [["p_nome", "Fulano de Tal"], ["updated_at", "2015-06-29 23:34:19.207883"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @aluno.update(aluno_params)