app/controllers/professors_controller.rb

UPDATE "professors" SET "pf_nome" = ?, "updated_at" = ? WHERE "professors"."id" = ?  [["pf_nome", "Ciclano Da Silva"], ["updated_at", "2015-06-29 23:36:41.632868"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @professor.update(professor_params)