app/controllers/quests_controller.rb

  def index
    @quests = Quest.all
---
SELECT "quests".* FROM "quests"

  def create
    @quest = Quest.new(quest_params)

    respond_to do |format|
      if @quest.save
---
INSERT INTO "quests" ("quest_enum", "quest_alternativas", "quest_resp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @quest.update(quest_params)
---
UPDATE "quests" SET "quest_enum" = ?, "quest_alternativas" = ?, "quest_resp" = ?, "updated_at" = ? WHERE "quests"."id" = ?  [["quest_enum", ""], ["quest_alternativas", ""], ["quest_resp", ""], ["updated_at", "2015-06-29 12:15:33.902012"], ["id", 1]]

    def set_quest
      @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT 1  [["id", 1]]